#!/usr/bin/python3

"""
温度转换

温度的刻画有两个不同体系：摄氏度（Celsius）和华氏度（Fahrenheit）。
请编写程序将用户输入华氏度转换为摄氏度，或将输入的摄氏度转换为华氏度。

转换算法如下：（C表示摄氏度、F表示华氏度）
C = ( F - 32 ) / 1.8
F = C * 1.8 + 32

要求如下：
(1) 输入输出的摄氏度可采用大小写字母C结尾，温度可以是整数或小数，如：12.34C指摄氏度12.34度；
(2) 输入输出的华氏度可采用大小写字母F结尾，温度可以是整数或小数，如：87.65F指华氏度87.65度；
(3) 输出保留小数点后两位，输入格式错误时，输出提示：输入格式错误；
"""

TempStr = input("请输入带有符号的温度值：")
if TempStr[-1] in ["F", 'f']:
    C = (eval(TempStr[0:-1]) - 32) / 1.8
    print("转换后的温度是：{:.2f}C".format(C))
elif TempStr[-1] in ['C', "c"]:
    F = eval(TempStr[0:-1]) * 1.8 + 32
    print('转换后的温度是：{:.2f}F'.format(F))
else:
    print('输入格式错误')
