#!/usr/bin/python3

"""
二维数据表格输出

tabulate 能够对二维数据进行表格输出，是Python优秀的第三方计算生态。

参考编程模板中给定的数据和代码，编写程序，能够输出如下风格效果的表格数据。

+--------------+------+------+
| 北京理工大学 | 985  | 2000 |
+--------------+------+------+
| 清华大学     | 985  | 3000 |
+--------------+------+------+
| 大连理工大学 | 985  | 4000 |
+--------------+------+------+
| 深圳大学     | 211  | 2000 |
+--------------+------+------+
| 沈阳大学     | 省本 | 2000 |
+--------------+------+------+

说明：
使用第三方库 tabulate 用于表格输出

表格格式有：
simple, plain, grid, outline,
simple_grid, rounded_grid, heavy_grid, mixed_grid, double_grid, fancy_grid
"""

import tabulate

data = [["北京理工大学", "985", 2000],
        ["清华大学", "985", 3000],
        ["大连理工大学", "985", 4000],
        ["深圳大学", "211", 2000],
        ["沈阳大学", "省本", 2000]]
print(tabulate.tabulate(data, tablefmt="grid"))
